# Создать множество
'''A = {2, 4, 6, 1, 1, 1, 3, 5}
print(A)  # {1, 2, 3, 4, 5, 6}

B = set()
print(B)'''

# Операции над множествами
'''A = {2, 4, 6, 1, 1, 1, 3, 5}
B = {0, 7, 1, 2, 8}

print(A & B) # {1, 2}
print(A | B) # {0, 1, 2, 3, 4, 5, 6, 7, 8}
print(A - B) # {3, 4, 5, 6}
print(B - A) # {0, 8, 7}'''

C = {2, 4, 6, 1, 1, 1, 3, 5, "f", "Привет!"}
# add() для одного
#update для нескольких
'''C.add(10) # {1, 2, 3, 4, 5, 6, 'Привет!', 10, 'f'}
print(C)
C.update([2020], (11,12,13), {100, "M"})
print(C)'''
'''C.discard(500)
#C.remove(500)
print(C)'''

